test/fixtures/cassettes/process_milestone_donation.json

[
  {
    "request": {
      "body": "{\"template_id\":\"d92b0884-818d-4f54-926a-a529e5caa7d8\",\"subject\":null,\"send_at\":null,\"reply_to\":null,\"personalizations\":[{\"to\":[{\"email\":\"john.doe.0@example.com\"}],\"substitutions\":{\"-timeRemaining-\":\"4 days\",\"-firstName-\":\"John\",\"-completedChallengeDistance-\":\"51 Km\",\"-challengeURL-\":\"http://bravera.co/swcc-1/John-512\",\"-challengeDistance-\":\"150 Km\",\"-activityDistance-\":\"4.2 Km\"}}],\"mail_settings\":{\"sandbox_mode\":{\"enable\":true}},\"headers\":{},\"from\":{\"email\":\"admin@bravera.co\"},\"content\":null,\"attachments\":null}",
      "headers": {
        "Authorization": "Bearer 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",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sendgrid.com/v3/mail/send"
    },
    "response": {
      "binary": false,
      "body": "",
      "headers": {
        "Server": "nginx",
        "Date": "Sun, 09 Sep 2018 15:14:41 GMT",
        "Content-Type": "text/plain; charset=utf-8",
        "Content-Length": "0",
        "Connection": "keep-alive",
        "X-Message-Id": "0MPqHW8FQLC5ukS8dZ6SFw",
        "Access-Control-Allow-Origin": "https://sendgrid.api-docs.io",
        "Access-Control-Allow-Methods": "POST",
        "Access-Control-Allow-Headers": "Authorization, Content-Type, On-behalf-of, x-sg-elas-acl",
        "Access-Control-Max-Age": "600",
        "X-No-CORS-Reason": "https://sendgrid.com/docs/Classroom/Basics/API/cors.html"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer sk_test_ryIQqPXQDZoG1zxmWgZpn89q",
        "Content-Type": "application/x-www-form-urlencoded",
        "Stripe-Version": "2017-06-05"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges?amount=1000&currency=HKD&customer=cus_DYyQTnYmbkDjBV&description=Donation+to+Save+the+children+worldwide+via+Bravera.co&destination%5Baccount%5D=acct_1D7jlPINRN0GH189&destination%5Bamount%5D=880&receipt_email=camonz%40camonz.com"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"id\": \"ch_1D8UcYHjHTiyg867wJWlVnjf\",\n  \"object\": \"charge\",\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"application\": null,\n  \"application_fee\": null,\n  \"balance_transaction\": \"txn_1D8UcYHjHTiyg8675dedGtGj\",\n  \"captured\": true,\n  \"created\": 1536506082,\n  \"currency\": \"hkd\",\n  \"customer\": \"cus_DYyQTnYmbkDjBV\",\n  \"description\": \"Donation to Save the children worldwide via Bravera.co\",\n  \"destination\": \"acct_1D7jlPINRN0GH189\",\n  \"dispute\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\": {\n  },\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {\n  },\n  \"on_behalf_of\": \"acct_1D7jlPINRN0GH189\",\n  \"order\": null,\n  \"outcome\": {\n    \"network_status\": \"approved_by_network\",\n    \"reason\": null,\n    \"risk_level\": \"normal\",\n    \"risk_score\": 5,\n    \"seller_message\": \"Payment complete.\",\n    \"type\": \"authorized\"\n  },\n  \"paid\": true,\n  \"receipt_email\": \"camonz@camonz.com\",\n  \"receipt_number\": null,\n  \"refunded\": false,\n  \"refunds\": {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/charges/ch_1D8UcYHjHTiyg867wJWlVnjf/refunds\"\n  },\n  \"review\": null,\n  \"shipping\": null,\n  \"source\": {\n    \"id\": \"src_1D7qTcHjHTiyg867gAya4pe5\",\n    \"object\": \"source\",\n    \"amount\": null,\n    \"card\": {\n      \"exp_month\": 3,\n      \"exp_year\": 2025,\n      \"address_zip_check\": \"pass\",\n      \"brand\": \"Visa\",\n      \"card_automatically_updated\": false,\n      \"country\": \"US\",\n      \"cvc_check\": \"pass\",\n      \"fingerprint\": \"RGDsyCoGNIhyQvZg\",\n      \"funding\": \"credit\",\n      \"last4\": \"4242\",\n      \"three_d_secure\": \"optional\",\n      \"name\": null,\n      \"address_line1_check\": null,\n      \"tokenization_method\": null,\n      \"dynamic_last4\": null\n    },\n    \"client_secret\": \"src_client_secret_DYyQ0qAHHkc5juYtY3NwxwxZ\",\n    \"created\": 1536506082,\n    \"currency\": null,\n    \"customer\": \"cus_DYyQTnYmbkDjBV\",\n    \"flow\": \"none\",\n    \"livemode\": false,\n    \"metadata\": {\n    },\n    \"owner\": {\n      \"address\": {\n        \"city\": null,\n        \"country\": null,\n        \"line1\": null,\n        \"line2\": null,\n        \"postal_code\": \"90210\",\n        \"state\": null\n      },\n      \"email\": \"camonz@camonz.com\",\n      \"name\": \"John Doe\",\n      \"phone\": null,\n      \"verified_address\": null,\n      \"verified_email\": null,\n      \"verified_name\": null,\n      \"verified_phone\": null\n    },\n    \"statement_descriptor\": null,\n    \"status\": \"chargeable\",\n    \"type\": \"card\",\n    \"usage\": \"reusable\"\n  },\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"status\": \"succeeded\",\n  \"transfer\": \"tr_1D8UcYHjHTiyg867TCsV6uUS\",\n  \"transfer_group\": \"group_ch_1D8UcYHjHTiyg867wJWlVnjf\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Sun, 09 Sep 2018 15:14:43 GMT",
        "Content-Type": "application/json",
        "Content-Length": "2644",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Expose-Headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_MsPltpEqlOgcmi",
        "Stripe-Version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]